Revit 2027 API
DisplacementElement.GetDisplacedElementIds Method
 The ids of the elements affected by this DisplacementElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetDisplacedElementIds()
Public Function GetDisplacedElementIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetDisplacedElementIds()
member GetDisplacedElementIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The element ids.
See Also
Reference
DisplacementElement Class
GetDisplacedElementIds Overload
Autodesk.Revit.DB Namespace